import {Avatar, Box, Divider, Flex, Grid, GridItem, Link, Text} from '@chakra-ui/react';
import React, {useEffect, useState} from 'react'
import {Block} from '../../config/ui/Block';
import axios from "axios";
import {BACKEND_API_URL} from "../../config/app.config";

interface ContactsInterface {
}

export const Contacts: React.FC<ContactsInterface> = () => {
    const [arr, setArr] = useState([])

    useEffect(() => {
        axios.get(`${BACKEND_API_URL}contacts`,{
            headers: {
                "Authorization": `${localStorage.getItem('token')}`
            }
        })
            .then(resp => setArr(() => resp.data))
            .catch(error => console.log("contacts- error", error))
    },[])

    return (
        <Flex flexDirection={"column"}>
            {arr.map((item:any, number: number) =>
                <Flex key={number} mb={2}>
                    <Block w={'100%'} borderRadius='6px' p={5}>
                        <Grid
                            templateColumns={{
                                base: 'repeat(1, 1fr)',
                                md: "repeat(6, 1fr)",
                                lg: "repeat(10, 1fr)",
                            }}
                            alignItems={"center"}
                            gap={6}>
                            <GridItem colSpan={3}>
                                <Flex alignItems='center'>
                                    <Box>
                                        <Avatar size={'lg'}
                                                name={item.name}
                                                src="https://bit.ly/sage-adebayo"
                                        />
                                    </Box>
                                    <Flex flexDirection={'column'} pl={'1.5rem'}>
                                        <Text fontWeight={600}>{item.name + " " + item.id}</Text>
                                        <Text color={'#BEC4DF'} fontSize={'0.875rem'}>Frontend Developer</Text>
                                    </Flex>
                                </Flex>
                            </GridItem>
                            <GridItem colSpan={3}>
                                <Flex flexDirection={'column'}>
                                    <Link pt={5} color={'#BEC4DF'} d={'flex'} alignItems='center'>
                                        <svg xmlns="http://www.w3.org/2000/svg" width="15.977" height="16"
                                             viewBox="0 0 15.977 16">
                                            <g id="phone-call_8_" data-name="phone-call (8)"
                                               transform="translate(-0.012)">
                                                <g id="Сгруппировать_30" data-name="Сгруппировать 30">
                                                    <g id="Сгруппировать_29" data-name="Сгруппировать 29">
                                                        <path id="Контур_83" data-name="Контур 83"
                                                              d="M12.645,9.911A1.574,1.574,0,0,0,11.5,9.388a1.627,1.627,0,0,0-1.155.52L9.282,10.972c-.088-.047-.176-.091-.26-.135-.122-.061-.236-.118-.334-.179A11.6,11.6,0,0,1,5.908,8.125,6.842,6.842,0,0,1,5,6.686c.277-.253.534-.517.783-.77.095-.095.189-.192.284-.287a1.549,1.549,0,0,0,0-2.337l-.922-.922c-.1-.1-.213-.213-.314-.321-.2-.209-.415-.425-.635-.628a1.6,1.6,0,0,0-1.131-.5,1.654,1.654,0,0,0-1.148.5l-.007.007L.758,2.587a2.471,2.471,0,0,0-.733,1.57A5.92,5.92,0,0,0,.458,6.663a14.54,14.54,0,0,0,2.583,4.309,15.891,15.891,0,0,0,5.292,4.143,8.245,8.245,0,0,0,2.972.878c.071,0,.145.007.213.007a2.545,2.545,0,0,0,1.948-.837c0-.007.01-.01.014-.017a7.677,7.677,0,0,1,.591-.611c.145-.138.294-.284.439-.436a1.685,1.685,0,0,0,.51-1.168,1.623,1.623,0,0,0-.52-1.158Zm1.209,3.556s0,0,0,0c-.132.142-.267.27-.412.412a8.879,8.879,0,0,0-.652.675,1.628,1.628,0,0,1-1.27.537c-.051,0-.1,0-.155,0a7.324,7.324,0,0,1-2.634-.79,15,15,0,0,1-4.984-3.9A13.71,13.71,0,0,1,1.316,6.345,4.822,4.822,0,0,1,.937,4.231a1.55,1.55,0,0,1,.466-1L2.555,2.077a.768.768,0,0,1,.513-.24.722.722,0,0,1,.493.236l.01.01c.206.192.4.392.608.6.1.108.213.216.321.328l.922.922a.644.644,0,0,1,0,1.047c-.1.1-.192.2-.29.29-.284.29-.554.561-.848.824-.007.007-.014.01-.017.017a.689.689,0,0,0-.176.767l.01.03a7.4,7.4,0,0,0,1.091,1.78l0,0a12.394,12.394,0,0,0,3,2.729,4.611,4.611,0,0,0,.415.226c.122.061.236.118.334.179.014.007.027.017.041.024a.732.732,0,0,0,.334.084.722.722,0,0,0,.513-.233l1.155-1.155a.764.764,0,0,1,.51-.253.688.688,0,0,1,.486.247l.007.007,1.861,1.861A.668.668,0,0,1,13.854,13.467Z"
                                                              fill="#bec4df"/>
                                                        <path id="Контур_84" data-name="Контур 84"
                                                              d="M8.647,3.806a4.346,4.346,0,0,1,3.539,3.539.453.453,0,0,0,.449.378.6.6,0,0,0,.078-.007.456.456,0,0,0,.375-.527A5.255,5.255,0,0,0,8.805,2.908a.458.458,0,0,0-.527.371A.451.451,0,0,0,8.647,3.806Z"
                                                              fill="#bec4df"/>
                                                        <path id="Контур_85" data-name="Контур 85"
                                                              d="M15.981,7.058A8.653,8.653,0,0,0,8.93.007a.455.455,0,1,0-.149.9,7.729,7.729,0,0,1,6.3,6.3.453.453,0,0,0,.449.378.6.6,0,0,0,.078-.007A.447.447,0,0,0,15.981,7.058Z"
                                                              fill="#bec4df"/>
                                                    </g>
                                                </g>
                                            </g>
                                        </svg>
                                        <Text as={'span'} pl={4}>
                                            +998 90 800 80 50
                                        </Text>

                                    </Link>
                                    <Link pt={3} color={'#BEC4DF'} d={'flex'} alignItems='center'>
                                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="11.25"
                                             viewBox="0 0 16 11.25">
                                            <g id="mail_1_" data-name="mail (1)" transform="translate(0 -2.375)">
                                                <g id="Сгруппировать_32" data-name="Сгруппировать 32">
                                                    <g id="Сгруппировать_31" data-name="Сгруппировать 31">
                                                        <path id="Контур_86" data-name="Контур 86"
                                                              d="M14.594,2.375H1.406A1.408,1.408,0,0,0,0,3.781v8.438a1.408,1.408,0,0,0,1.406,1.406H14.594A1.408,1.408,0,0,0,16,12.219V3.781A1.408,1.408,0,0,0,14.594,2.375Zm-.2.938-5.4,5.374a1.406,1.406,0,0,1-1.99,0L1.6,3.313ZM.938,12.028V3.973L4.989,8Zm.666.66,4.05-4.024.689.686a2.344,2.344,0,0,0,3.314,0l.69-.687,4.05,4.024Zm13.459-.66L11.011,8l4.051-4.03Z"
                                                              fill="#bec4df"/>
                                                    </g>
                                                </g>
                                            </g>
                                        </svg>
                                        <Text as={'span'} pl={4}>
                                            example@mail.ru
                                        </Text>

                                    </Link>
                                </Flex>
                            </GridItem>
                            <GridItem colSpan={{base: 2, md: 3 , lg: 2}}>
                                <Flex alignItems={'center'} justifyContent={"space-around"}>
                                    <Link css={{"svg:hover path": {fill: "#36AB7E"} }}>
                                        <svg id="telegram_6_" data-name="telegram (6)"
                                             xmlns="http://www.w3.org/2000/svg"
                                             width="16"
                                             height="13.537" viewBox="0 0 16 13.537">
                                            <path id="Контур_87" data-name="Контур 87"
                                                  d="M15.753.371A1.039,1.039,0,0,0,14.929,0a1.617,1.617,0,0,0-.575.115L.81,5.285c-.719.274-.816.686-.809.907s.126.626.859.86l.013,0,2.809.8L5.2,12.2a1.312,1.312,0,0,0,1.214.96,1.436,1.436,0,0,0,.971-.414l1.738-1.6,2.52,2.029h0l.024.019.007.005a1.455,1.455,0,0,0,.885.332h0a1.242,1.242,0,0,0,1.184-1.1L15.963,1.479a1.309,1.309,0,0,0-.21-1.108ZM4.622,7.706l5.42-2.769L6.667,8.523a.468.468,0,0,0-.114.209L5.9,11.368ZM6.751,12.06c-.022.021-.045.039-.068.056l.6-2.445,1.1.884ZM15.045,1.293,12.825,12.25c-.021.1-.09.349-.265.349a.546.546,0,0,1-.307-.133L9.4,10.167h0L7.7,8.8l4.88-5.186a.469.469,0,0,0-.555-.739L4,6.974,1.148,6.159,14.688.99a.688.688,0,0,1,.241-.053c.029,0,.08,0,.1.027a.447.447,0,0,1,.017.328Zm0,0"
                                                  fill="#bec4df"/>
                                        </svg>

                                    </Link>
                                    <Link css={{"svg:hover path": {fill: "#36AB7E"} }}>
                                        <svg xmlns="http://www.w3.org/2000/svg" width="8.001" height="16"
                                             viewBox="0 0 8.001 16">
                                            <g id="facebook_8_" data-name="facebook (8)" transform="translate(-4.125)">
                                                <path id="Контур_88" data-name="Контур 88"
                                                      d="M10.665,2.657h1.461V.113A18.861,18.861,0,0,0,10,0C7.891,0,6.449,1.325,6.449,3.759V6H4.125V8.844H6.449V16H9.3V8.845h2.23L11.882,6H9.3V4.041c0-.822.222-1.385,1.367-1.385Z"
                                                      fill="#bec4df"/>
                                            </g>
                                        </svg>

                                    </Link>
                                    <Link css={{"svg:hover path": {fill: "#36AB7E"} }}>
                                        <svg xmlns="http://www.w3.org/2000/svg" width="15.999" height="16"
                                             viewBox="0 0 15.999 16">
                                            <g id="instagram_9_" data-name="instagram (9)" transform="translate(0 0)">
                                                <path id="Контур_89" data-name="Контур 89"
                                                      d="M8.157,16H8c-1.254,0-2.413-.029-3.54-.1A4.732,4.732,0,0,1,1.731,14.87,4.378,4.378,0,0,1,.26,12.495,10.525,10.525,0,0,1,.018,9.982C.01,9.4,0,8.705,0,8S.01,6.6.018,6.018A10.526,10.526,0,0,1,.26,3.505,4.378,4.378,0,0,1,1.731,1.13,4.732,4.732,0,0,1,4.458.1C5.585.029,6.744,0,8,0s2.413.029,3.54.1A4.732,4.732,0,0,1,14.269,1.13,4.378,4.378,0,0,1,15.74,3.505a10.525,10.525,0,0,1,.241,2.513C15.989,6.6,16,7.295,16,8V8c0,.7-.01,1.4-.018,1.98a10.52,10.52,0,0,1-.241,2.513,4.378,4.378,0,0,1-1.471,2.375A4.732,4.732,0,0,1,11.541,15.9c-1.079.066-2.188.1-3.384.1ZM8,14.75c1.234,0,2.367-.028,3.467-.1a3.443,3.443,0,0,0,2.014-.754,3.156,3.156,0,0,0,1.05-1.715,9.575,9.575,0,0,0,.2-2.221c.008-.58.016-1.267.018-1.964s-.01-1.384-.018-1.964a9.577,9.577,0,0,0-.2-2.221A3.156,3.156,0,0,0,13.479,2.1a3.444,3.444,0,0,0-2.014-.753c-1.1-.067-2.233-.1-3.464-.1s-2.366.028-3.467.1A3.444,3.444,0,0,0,2.521,2.1a3.156,3.156,0,0,0-1.05,1.715,9.576,9.576,0,0,0-.2,2.221C1.26,6.616,1.252,7.3,1.25,8s.01,1.382.018,1.963a9.575,9.575,0,0,0,.2,2.221A3.156,3.156,0,0,0,2.521,13.9a3.444,3.444,0,0,0,2.014.753C5.635,14.722,6.768,14.753,8,14.75Zm-.03-2.844A3.906,3.906,0,1,1,11.875,8,3.911,3.911,0,0,1,7.968,11.906Zm0-6.563A2.656,2.656,0,1,0,10.625,8,2.659,2.659,0,0,0,7.968,5.344Zm4.344-2.5a.938.938,0,1,0,.938.938A.938.938,0,0,0,12.312,2.844Zm0,0"
                                                      fill="#bec4df"/>
                                            </g>
                                        </svg>

                                    </Link>
                                </Flex>
                            </GridItem>
                            <GridItem colSpan={{base: 2, md: 3 , lg: 2}} h={'100%'}>
                                <Flex h={'100%'} alignItems={"center"}>
                                    <Divider d={{base: "none", md: "block"}} w={'2px'} orientation="vertical"/>
                                    <Flex alignItems={"center"} justifyContent={"center"} flex={1}>
                                        <Box>
                                            <Text fontSize={'1.125rem'} color={'#36AB7E'} fontWeight={700}>
                                                +0.024$
                                            </Text>
                                            <Text fontSize={'0.875rem'}>+000.39%</Text>
                                        </Box>
                                    </Flex>
                                </Flex>
                            </GridItem>
                        </Grid>
                    </Block>
                </Flex>
            )}
        </Flex>
    )
};
